bench/results/java21/20260309T234656Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 6208.6, "p50": "3.65ms", "p95": "6.78ms", "p99": "8.02ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.87ms    1.30ms  24.73ms   73.00%\n    Req/Sec     1.56k   145.71     1.83k    75.29%\n  Latency Distribution\n     50%    3.65ms\n     75%    4.53ms\n     90%    5.54ms\n     99%    8.02ms\n  745240 requests in 2.00m, 169.86MB read\nRequests/sec:   6208.60\nTransfer/sec:      1.42MB"}